app/controllers/messages_controller.rb

  def create
    username = params[:message][:username] || "default"
    message = Message.new(message_params)
    message.user = User.where(username: username).first_or_create(username: username)
---
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hi"], ["user_id", 2], ["created_at", 2016-09-20 09:21:04 UTC], ["updated_at", 2016-09-20 09:21:04 UTC]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "default"], ["created_at", 2016-09-20 09:21:04 UTC], ["updated_at", 2016-09-20 09:21:04 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "default"], ["LIMIT", 1]]